Revit 2027 API
BuiltInFailures.DuctFailures.PartNotFoundDueToNoDuctConnectedError Property
 "In order to find a matching part, the fitting has to be connected to a duct."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PartNotFoundDueToNoDuctConnectedError { get; }
Public Shared ReadOnly Property PartNotFoundDueToNoDuctConnectedError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PartNotFoundDueToNoDuctConnectedError {
	FailureDefinitionId^ get ();
}
static member PartNotFoundDueToNoDuctConnectedError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DuctFailures Class
Autodesk.Revit.DB Namespace